In [5]:
import pandas as pd
titanic_train = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")
titanic_train

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [3]:
titanic_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
titanic_train.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [5]:
type(titanic_train)

pandas.core.frame.DataFrame

In [8]:
titanic_train.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [15]:
type(titanic_train.columns)

pandas.core.indexes.base.Index

In [9]:
titanic_train.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [25]:
type(titanic_train.dtypes)

pandas.core.series.Series

In [21]:
dy= titanic_train.dtypes

In [22]:
dy

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [24]:
dy["Pclass"]

dtype('int64')

In [26]:
dy["Name"]

dtype('O')

In [27]:
dy[0]

dtype('int64')

In [28]:
dy[0:4]

PassengerId     int64
Survived        int64
Pclass          int64
Name           object
dtype: object

In [10]:
titanic_train.shape

(891, 12)

In [11]:
titanic_train.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [30]:
titanic_train[["Age"]][0:100]

     Age
0   22.0
1   38.0
2   26.0
3   35.0
4   35.0
..   ...
95   NaN
96  71.0
97  23.0
98  34.0
99  34.0

[100 rows x 1 columns]

In [31]:
titanic_train[["Age"]][::-1]

      Age
890  32.0
889  26.0
888   NaN
887  19.0
886  27.0
..    ...
4    35.0
3    35.0
2    26.0
1    38.0
0    22.0

[891 rows x 1 columns]

In [32]:
titanic_train[titanic_train.Age%2==0]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [39]:
idx= titanic_train.dtypes[titanic_train.dtypes=="object"].index
idx

Index(['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked'], dtype='object')

In [38]:
titanic_train[idx].describe()

                           Name   Sex  Ticket    Cabin Embarked
count                       891   891     891      204      889
unique                      891     2     681      147        3
top     Braund, Mr. Owen Harris  male  347082  B96 B98        S
freq                          1   577       7        4      644

In [42]:
titanic_train[titanic_train.dtypes[titanic_train.dtypes=="object"].index]

,Name,Sex,Ticket,Cabin,Embarked
0,"Braund, Mr. Owen Harris",male,A/5 21171,NaN,S
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,PC 17599,C85,C
2,"Heikkinen, Miss. Laina",female,STON/O2. 3101282,NaN,S
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,113803,C123,S
4,"Allen, Mr. William Henry",male,373450,NaN,S
...,...,...,...,...,...
886,"Montvila, Rev. Juozas",male,211536,NaN,S
887,"Graham, Miss. Margaret Edith",female,112053,B42,S
888,"Johnston, Miss. Catherine Helen ""Carrie""",female,W./C. 6607,NaN,S
889,"Behr, Mr. Karl Howell",male,111369,C148,C
890,"Dooley, Mr. Patrick",male,370376,NaN,Q

In [44]:
x= titanic_train[titanic_train.dtypes[titanic_train.dtypes=="object"].index]

In [45]:
x.describe()

                           Name   Sex  Ticket    Cabin Embarked
count                       891   891     891      204      889
unique                      891     2     681      147        3
top     Braund, Mr. Owen Harris  male  347082  B96 B98        S
freq                          1   577       7        4      644

In [47]:
titanic_train.Age.isnull().sum()

177

In [6]:
import numpy as np

In [53]:
age_null_index= np.where(titanic_train.Age.isnull()==True)

In [54]:
age_null_index

(array([  5,  17,  19,  26,  28,  29,  31,  32,  36,  42,  45,  46,  47,
         48,  55,  64,  65,  76,  77,  82,  87,  95, 101, 107, 109, 121,
        126, 128, 140, 154, 158, 159, 166, 168, 176, 180, 181, 185, 186,
        196, 198, 201, 214, 223, 229, 235, 240, 241, 250, 256, 260, 264,
        270, 274, 277, 284, 295, 298, 300, 301, 303, 304, 306, 324, 330,
        334, 335, 347, 351, 354, 358, 359, 364, 367, 368, 375, 384, 388,
        409, 410, 411, 413, 415, 420, 425, 428, 431, 444, 451, 454, 457,
        459, 464, 466, 468, 470, 475, 481, 485, 490, 495, 497, 502, 507,
        511, 517, 522, 524, 527, 531, 533, 538, 547, 552, 557, 560, 563,
        564, 568, 573, 578, 584, 589, 593, 596, 598, 601, 602, 611, 612,
        613, 629, 633, 639, 643, 648, 650, 653, 656, 667, 669, 674, 680,
        692, 697, 709, 711, 718, 727, 732, 738, 739, 740, 760, 766, 768,
        773, 776, 778, 783, 790, 792, 793, 815, 825, 826, 828, 832, 837,
        839, 846, 849, 859, 863, 868, 878, 888], dtype=int64),)

In [52]:
titanic_train[titanic_train.Age.isnull()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C
26,27,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,NaN,C
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,330959,7.8792,NaN,Q
...,...,...,...,...,...,...,...,...,...,...,...,...
859,860,0,3,"Razi, Mr. Raihed",male,NaN,0,0,2629,7.2292,NaN,C
863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,NaN,S
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S
878,879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,NaN,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [58]:
titanic_train.iloc[age_null_index]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C
26,27,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,NaN,C
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,330959,7.8792,NaN,Q
...,...,...,...,...,...,...,...,...,...,...,...,...
859,860,0,3,"Razi, Mr. Raihed",male,NaN,0,0,2629,7.2292,NaN,C
863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,NaN,S
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S
878,879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,NaN,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [61]:
titanic_train.iloc[[1,2,3,4]]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [63]:
max(titanic_train.Fare)

512.3292

In [76]:
np.where(titanic_train.Fare== max(titanic_train.Fare))

(array([258, 679, 737], dtype=int64),)

In [66]:
titanic_train.iloc

(array([258, 679, 737], dtype=int64),)

In [79]:
titanic_train.iloc[np.where(titanic_train.Fare== max(titanic_train.Fare))]["Name"]

258                      Ward, Miss. Anna
679    Cardeza, Mr. Thomas Drake Martinez
737                Lesurer, Mr. Gustave J
Name: Name, dtype: object

In [89]:
idx= np.where(titanic_train.Fare== max(titanic_train.Fare))

In [90]:
idx

(array([258, 679, 737], dtype=int64),)

In [91]:
for i in idx:
    print(titanic_train.iloc[i]["Name"])

258                      Ward, Miss. Anna
679    Cardeza, Mr. Thomas Drake Martinez
737                Lesurer, Mr. Gustave J
Name: Name, dtype: object

In [92]:
titanic_train.iloc[5]

PassengerId                   6
Survived                      0
Pclass                        3
Name           Moran, Mr. James
Sex                        male
Age                         NaN
SibSp                         0
Parch                         0
Ticket                   330877
Fare                     8.4583
Cabin                       NaN
Embarked                      Q
Name: 5, dtype: object

In [93]:
type(titanic_train.iloc[5])

pandas.core.series.Series

In [96]:
titanic_train[titanic_train.Fare == titanic_train.Fare.max()]["Name"]

258                      Ward, Miss. Anna
679    Cardeza, Mr. Thomas Drake Martinez
737                Lesurer, Mr. Gustave J
Name: Name, dtype: object

In [97]:
titanic_train[titanic_train["Fare"] == titanic_train["Fare"].max()]["Name"]

258                      Ward, Miss. Anna
679    Cardeza, Mr. Thomas Drake Martinez
737                Lesurer, Mr. Gustave J
Name: Name, dtype: object

In [101]:
titanic_train[titanic_train.Age== min(titanic_train.Age)]["Name"]

803    Thomas, Master. Assad Alexander
Name: Name, dtype: object

In [99]:
min(titanic_train.Age)

0.42

In [102]:
titanic_train[titanic_train["Age"]==titanic_train["Age"].min()]["Name"]

803    Thomas, Master. Assad Alexander
Name: Name, dtype: object

In [105]:
min_age_ind= np.where(titanic_train.Age== min(titanic_train.Age))

In [106]:
min_age_ind

(array([803], dtype=int64),)

In [107]:
for i in min_age_ind:
    print(titanic_train.iloc[i]["Name"])

803    Thomas, Master. Assad Alexander
Name: Name, dtype: object

In [109]:
titanic_train.iloc[min_age_ind]["Name"]

803    Thomas, Master. Assad Alexander
Name: Name, dtype: object

In [113]:
titanic_train[titanic_train.Age == 24][["Name","Age"]]

                                                  Name   Age
89                              Celotti, Mr. Francesco  24.0
118                           Baxter, Mr. Quigg Edmond  24.0
127                          Madsen, Mr. Fridtjof Arne  24.0
139                                 Giglio, Mr. Victor  24.0
142  Hakkarainen, Mrs. Pekka Pietari (Elin Matilda ...  24.0
199             Yrois, Miss. Henriette ("Mrs Harbeck")  24.0
210                                     Ali, Mr. Ahmed  24.0
234                  Leyson, Mr. Robert William Norman  24.0
247                    Hamalainen, Mrs. William (Anna)  24.0
293                                Haas, Miss. Aloisia  24.0
294                                   Mineff, Mr. Ivan  24.0
310                     Hays, Miss. Margaret Bechstein  24.0
316                Kantor, Mrs. Sinai (Miriam Sternin)  24.0
341                     Fortune, Miss. Alice Elizabeth  24.0
345                      Brown, Miss. Amelia "Mildred"  24.0
369                      Aubart, Mme. Leontine Pauline  24.0
394  Sandstrom, Mrs. Hjalmar (Agnes Charlotta Bengt...  24.0
437              Richards, Mrs. Sidney (Emily Hocking)  24.0
499                                 Svensson, Mr. Olof  24.0
514                                  Coleff, Mr. Satio  24.0
565                               Davies, Mr. Alfred J  24.0
600  Jacobsohn, Mrs. Sidney Samuel (Amy Frances Chr...  24.0
615                                Herman, Miss. Alice  24.0
641                               Sagesser, Mlle. Emma  24.0
655                          Hickman, Mr. Leonard Mark  24.0
710   Mayne, Mlle. Berthe Antonine ("Mrs de Villiers")  24.0
743                                  McNamee, Mr. Neal  24.0
770                             Lievens, Mr. Rene Aime  24.0
858              Baclini, Mrs. Solomon (Latifa Qurban)  24.0
864                             Gill, Mr. John William  24.0

In [119]:
age_24_indx= np.where(titanic_train.Age==24)
for i in age_24_indx:
    print(titanic_train.iloc[i][["Name","Age"]])

                                                  Name   Age
89                              Celotti, Mr. Francesco  24.0
118                           Baxter, Mr. Quigg Edmond  24.0
127                          Madsen, Mr. Fridtjof Arne  24.0
139                                 Giglio, Mr. Victor  24.0
142  Hakkarainen, Mrs. Pekka Pietari (Elin Matilda ...  24.0
199             Yrois, Miss. Henriette ("Mrs Harbeck")  24.0
210                                     Ali, Mr. Ahmed  24.0
234                  Leyson, Mr. Robert William Norman  24.0
247                    Hamalainen, Mrs. William (Anna)  24.0
293                                Haas, Miss. Aloisia  24.0
294                                   Mineff, Mr. Ivan  24.0
310                     Hays, Miss. Margaret Bechstein  24.0
316                Kantor, Mrs. Sinai (Miriam Sternin)  24.0
341                     Fortune, Miss. Alice Elizabeth  24.0
345                      Brown, Miss. Amelia "Mildred"  24.0
369                      Aubart, Mme. Leontine Pauline  24.0
394  Sandstrom, Mrs. Hjalmar (Agnes Charlotta Bengt...  24.0
437              Richards, Mrs. Sidney (Emily Hocking)  24.0
499                                 Svensson, Mr. Olof  24.0
514                                  Coleff, Mr. Satio  24.0
565                               Davies, Mr. Alfred J  24.0
600  Jacobsohn, Mrs. Sidney Samuel (Amy Frances Chr...  24.0
615                                Herman, Miss. Alice  24.0
641                               Sagesser, Mlle. Emma  24.0
655                          Hickman, Mr. Leonard Mark  24.0
710   Mayne, Mlle. Berthe Antonine ("Mrs de Villiers")  24.0
743                                  McNamee, Mr. Neal  24.0
770                             Lievens, Mr. Rene Aime  24.0
858              Baclini, Mrs. Solomon (Latifa Qurban)  24.0
864                             Gill, Mr. John William  24.0

In [148]:
type(titanic_train.iloc[5])

pandas.core.series.Series

In [147]:
titanic_train.iloc[5][["PassengerId", "Sex"]]

PassengerId       6
Sex            male
Name: 5, dtype: object

In [149]:
type(titanic_train.iloc[5][["PassengerId", "Sex"]])

pandas.core.series.Series

In [125]:
titanic_train[titanic_train["Cabin"].isnull()][["Age","Cabin"]]

      Age Cabin
0    22.0   NaN
2    26.0   NaN
4    35.0   NaN
5     NaN   NaN
7     2.0   NaN
..    ...   ...
884  25.0   NaN
885  39.0   NaN
886  27.0   NaN
888   NaN   NaN
890  32.0   NaN

[687 rows x 2 columns]

In [128]:
titanic_train["Age"][titanic_train["Cabin"].isnull()]

0      22.0
2      26.0
4      35.0
5       NaN
7       2.0
       ...
884    25.0
885    39.0
886    27.0
888     NaN
890    32.0
Name: Age, Length: 687, dtype: float64

In [131]:
titanic_train[["Age", "Cabin"]][titanic_train["Cabin"].isnull()==True]

      Age Cabin
0    22.0   NaN
2    26.0   NaN
4    35.0   NaN
5     NaN   NaN
7     2.0   NaN
..    ...   ...
884  25.0   NaN
885  39.0   NaN
886  27.0   NaN
888   NaN   NaN
890  32.0   NaN

[687 rows x 2 columns]

In [137]:
nan_ind= np.where(titanic_train.Cabin.isnull()==True)
for i in nan_ind:
    print(titanic_train.iloc[i][["Age", "Cabin"]])

      Age Cabin
0    22.0   NaN
2    26.0   NaN
4    35.0   NaN
5     NaN   NaN
7     2.0   NaN
..    ...   ...
884  25.0   NaN
885  39.0   NaN
886  27.0   NaN
888   NaN   NaN
890  32.0   NaN

[687 rows x 2 columns]

In [139]:
titanic_train.iloc[np.where(titanic_train.Cabin.isnull()==True)][["Age", "Cabin"]]

      Age Cabin
0    22.0   NaN
2    26.0   NaN
4    35.0   NaN
5     NaN   NaN
7     2.0   NaN
..    ...   ...
884  25.0   NaN
885  39.0   NaN
886  27.0   NaN
888   NaN   NaN
890  32.0   NaN

[687 rows x 2 columns]

In [175]:
np.where(titanic_train.Cabin.isnull()==True)

(array([  0,   2,   4,   5,   7,   8,   9,  12,  13,  14,  15,  16,  17,
         18,  19,  20,  22,  24,  25,  26,  28,  29,  30,  32,  33,  34,
         35,  36,  37,  38,  39,  40,  41,  42,  43,  44,  45,  46,  47,
         48,  49,  50,  51,  53,  56,  57,  58,  59,  60,  63,  64,  65,
         67,  68,  69,  70,  71,  72,  73,  74,  76,  77,  78,  79,  80,
         81,  82,  83,  84,  85,  86,  87,  89,  90,  91,  93,  94,  95,
         98,  99, 100, 101, 103, 104, 105, 106, 107, 108, 109, 111, 112,
        113, 114, 115, 116, 117, 119, 120, 121, 122, 125, 126, 127, 129,
        130, 131, 132, 133, 134, 135, 138, 140, 141, 142, 143, 144, 145,
        146, 147, 149, 150, 152, 153, 154, 155, 156, 157, 158, 159, 160,
        161, 162, 163, 164, 165, 167, 168, 169, 171, 172, 173, 175, 176,
        178, 179, 180, 181, 182, 184, 186, 187, 188, 189, 190, 191, 192,
        196, 197, 198, 199, 200, 201, 202, 203, 204, 206, 207, 208, 210,
        211, 212, 213, 214, 216, 217, 219, 220, 221, 222, 223, 225, 226,
        227, 228, 229, 231, 232, 233, 234, 235, 236, 237, 238, 239, 240,
        241, 242, 243, 244, 246, 247, 249, 250, 253, 254, 255, 256, 258,
        259, 260, 261, 264, 265, 266, 267, 270, 271, 272, 274, 276, 277,
        278, 279, 280, 281, 282, 283, 285, 286, 287, 288, 289, 290, 293,
        294, 295, 296, 300, 301, 302, 304, 306, 308, 312, 313, 314, 315,
        316, 317, 320, 321, 322, 323, 324, 326, 328, 330, 333, 334, 335,
        338, 342, 343, 344, 346, 347, 348, 349, 350, 352, 353, 354, 355,
        357, 358, 359, 360, 361, 362, 363, 364, 365, 367, 368, 371, 372,
        373, 374, 375, 376, 378, 379, 380, 381, 382, 383, 384, 385, 386,
        387, 388, 389, 391, 392, 395, 396, 397, 398, 399, 400, 401, 402,
        403, 404, 405, 406, 407, 408, 409, 410, 411, 413, 414, 415, 416,
        417, 418, 419, 420, 421, 422, 423, 424, 425, 426, 427, 428, 431,
        432, 433, 436, 437, 439, 440, 441, 442, 443, 444, 446, 447, 448,
        450, 451, 454, 455, 458, 459, 461, 463, 464, 465, 466, 467, 468,
        469, 470, 471, 472, 474, 476, 477, 478, 479, 480, 481, 482, 483,
        485, 488, 489, 490, 491, 493, 494, 495, 497, 499, 500, 501, 502,
        503, 506, 507, 508, 509, 510, 511, 513, 514, 517, 518, 519, 521,
        522, 524, 525, 526, 528, 529, 530, 531, 532, 533, 534, 535, 537,
        538, 541, 542, 543, 545, 546, 547, 548, 549, 551, 552, 553, 554,
        555, 557, 559, 560, 561, 562, 563, 564, 565, 566, 567, 568, 569,
        570, 573, 574, 575, 576, 578, 579, 580, 582, 584, 586, 588, 589,
        590, 592, 593, 594, 595, 596, 597, 598, 600, 601, 602, 603, 604,
        605, 606, 607, 608, 610, 611, 612, 613, 614, 615, 616, 617, 619,
        620, 622, 623, 624, 626, 628, 629, 631, 633, 634, 635, 636, 637,
        638, 639, 640, 642, 643, 644, 646, 648, 649, 650, 651, 652, 653,
        654, 655, 656, 657, 658, 660, 661, 663, 664, 665, 666, 667, 668,
        670, 672, 673, 674, 675, 676, 677, 678, 680, 682, 683, 684, 685,
        686, 687, 688, 691, 692, 693, 694, 695, 696, 697, 702, 703, 704,
        705, 706, 708, 709, 713, 714, 718, 719, 720, 721, 722, 723, 725,
        726, 727, 728, 729, 731, 732, 733, 734, 735, 736, 738, 739, 743,
        744, 746, 747, 749, 750, 752, 753, 754, 755, 756, 757, 758, 760,
        761, 762, 764, 766, 767, 768, 769, 770, 771, 773, 774, 775, 777,
        778, 780, 783, 784, 785, 786, 787, 788, 790, 791, 792, 793, 794,
        795, 797, 798, 799, 800, 801, 803, 804, 805, 807, 808, 810, 811,
        812, 813, 814, 816, 817, 818, 819, 821, 822, 824, 825, 826, 827,
        828, 830, 831, 832, 833, 834, 836, 837, 838, 840, 841, 842, 843,
        844, 845, 846, 847, 848, 850, 851, 852, 854, 855, 856, 858, 859,
        860, 861, 863, 864, 865, 866, 868, 869, 870, 873, 874, 875, 876,
        877, 878, 880, 881, 882, 883, 884, 885, 886, 888, 890], dtype=int64),)

In [140]:
type(titanic_train.iloc[np.where(titanic_train.Cabin.isnull()==True)][["Age", "Cabin"]])

pandas.core.frame.DataFrame

In [180]:
titanic_train[(titanic_train.Survived==0) & (titanic_train.Sex=="male")]["Name"]

0             Braund, Mr. Owen Harris
4            Allen, Mr. William Henry
5                    Moran, Mr. James
6             McCarthy, Mr. Timothy J
7      Palsson, Master. Gosta Leonard
                    ...
881                Markun, Mr. Johann
883     Banfield, Mr. Frederick James
884            Sutehall, Mr. Henry Jr
886             Montvila, Rev. Juozas
890               Dooley, Mr. Patrick
Name: Name, Length: 468, dtype: object

In [182]:
titanic_train.Name[(titanic_train.Survived==0) & (titanic_train.Sex=="male")]

0             Braund, Mr. Owen Harris
4            Allen, Mr. William Henry
5                    Moran, Mr. James
6             McCarthy, Mr. Timothy J
7      Palsson, Master. Gosta Leonard
                    ...
881                Markun, Mr. Johann
883     Banfield, Mr. Frederick James
884            Sutehall, Mr. Henry Jr
886             Montvila, Rev. Juozas
890               Dooley, Mr. Patrick
Name: Name, Length: 468, dtype: object

In [183]:
titanic_train["Name"][(titanic_train.Survived==0) & (titanic_train.Sex=="male")]

0             Braund, Mr. Owen Harris
4            Allen, Mr. William Henry
5                    Moran, Mr. James
6             McCarthy, Mr. Timothy J
7      Palsson, Master. Gosta Leonard
                    ...
881                Markun, Mr. Johann
883     Banfield, Mr. Frederick James
884            Sutehall, Mr. Henry Jr
886             Montvila, Rev. Juozas
890               Dooley, Mr. Patrick
Name: Name, Length: 468, dtype: object

In [181]:
for i in titanic_train.PassengerId:
    if(titanic_train[titanic_train.Survived==0]) & (titanic_train[titanic_train.Sex=="male")):
        print(titanic_train.iloc[i] ["Name"])

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [184]:
l= [1,2,3,4,5]

In [185]:
pd.Series(l)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [186]:
d= {"first_name": "Shivang", "last_name": "Shritu", "mail_id": "shivang.cse.nitnagaland@gmail.com"}

In [188]:
pd.DataFrame(d, index=["first_name", "last_name", "mail_id"])

           first_name last_name                            mail_id
first_name    Shivang    Shritu  shivang.cse.nitnagaland@gmail.com
last_name     Shivang    Shritu  shivang.cse.nitnagaland@gmail.com
mail_id       Shivang    Shritu  shivang.cse.nitnagaland@gmail.com

In [189]:
pd.Series(d)

first_name                              Shivang
last_name                                Shritu
mail_id       shivang.cse.nitnagaland@gmail.com
dtype: object

In [190]:
import numpy as np

In [191]:
arr= np.random.randn(3,4)

In [192]:
pd.DataFrame(arr)

          0         1         2         3
0  1.547790  0.948304  0.245447  0.559336
1  0.481042  0.856979 -0.133901  0.909058
2  2.350385  0.932474  0.829993 -0.187888

In [193]:
pd.Series(arr)

ValueError: Data must be 1-dimensional

In [195]:
ser= pd.Series(np.array([1,2,3,4,5]),index=["a", "b", "c", "d", "e"])

In [196]:
ser

a    1
b    2
c    3
d    4
e    5
dtype: int32

In [198]:
ser["c"]

3

In [200]:
df1= pd.DataFrame(ser)

In [203]:
df1.loc["c"]

0    3
Name: c, dtype: int32

In [204]:
ser.loc["b"]

2

In [205]:
ser.iloc[1]

2

In [206]:
ser1= pd.Series(np.array([1,2,3,4,5]), index=[20,21,22,23,24])

In [207]:
ser1

20    1
21    2
22    3
23    4
24    5
dtype: int32

In [210]:
ser1.iloc[2]

3

In [211]:
ser1.loc[20]

1

In [217]:
df2= pd.DataFrame(np.random.randint(3,6,(4,5)), index=['a','b','c','d'], columns=['s','t','u','v','w'])

In [218]:
df2

   s  t  u  v  w
a  5  4  4  4  3
b  3  4  3  5  3
c  3  5  5  3  5
d  5  5  5  4  5

In [226]:
df2.loc[["c","d"], ["u","v"]]

   u  v
c  5  3
d  5  4

In [228]:
df2.iloc[2:,2:4]

   u  v
c  5  3
d  5  4

In [233]:
df2.drop("w",axis=1)

   s  t  u  v
a  5  4  4  4
b  3  4  3  5
c  3  5  5  3
d  5  5  5  4

In [234]:
np.random.seed(23)
df= pd.DataFrame(np.random.randn(4,5), index= ["a","b","c","d"], columns= ["s","t","u","v","w"])

In [235]:
df

          s         t         u         v         w
a  0.666988  0.025813 -0.777619  0.948634  0.701672
b -1.051082 -0.367548 -1.137460 -1.322148  1.772258
c -0.347459  0.670140  0.322272  0.060343 -1.043450
d -1.009942  0.441736  1.128877 -1.838068 -0.938769

In [240]:
df.values[df.values<0]

array([-0.77761941, -1.05108156, -0.36754812, -1.13745969, -1.32214752,
       -0.34745899, -1.04345   , -1.00994188, -1.83806777, -0.93876863])

In [244]:
df.values[df.iloc[0:4]<0]

array([-0.77761941, -1.05108156, -0.36754812, -1.13745969, -1.32214752,
       -0.34745899, -1.04345   , -1.00994188, -1.83806777, -0.93876863])

In [251]:
df

          s         t         u         v         w
a  0.666988  0.025813 -0.777619  0.948634  0.701672
b -1.051082 -0.367548 -1.137460 -1.322148  1.772258
c -0.347459  0.670140  0.322272  0.060343 -1.043450
d -1.009942  0.441736  1.128877 -1.838068 -0.938769

In [256]:
df.values[df.values<0]

array([-0.77761941, -1.05108156, -0.36754812, -1.13745969, -1.32214752,
       -0.34745899, -1.04345   , -1.00994188, -1.83806777, -0.93876863])

In [257]:
type(df.values[df<0])

numpy.ndarray

In [254]:
df.values

array([[ 0.66698806,  0.02581308, -0.77761941,  0.94863382,  0.70167179],
       [-1.05108156, -0.36754812, -1.13745969, -1.32214752,  1.77225828],
       [-0.34745899,  0.67014016,  0.32227152,  0.06034293, -1.04345   ],
       [-1.00994188,  0.44173637,  1.12887685, -1.83806777, -0.93876863]])

In [296]:
df

          s         t         u         v         w
a  0.666988  0.025813 -0.777619  0.948634  0.701672
b -1.051082 -0.367548 -1.137460 -1.322148  1.772258
c -0.347459  0.670140  0.322272  0.060343 -1.043450
d -1.009942  0.441736  1.128877 -1.838068 -0.938769

In [295]:
print(arr)

[-0.77761941 -1.05108156 -0.36754812 -1.13745969 -1.32214752 -0.34745899
 -1.04345    -1.00994188 -1.83806777 -0.93876863]

In [288]:
df.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [290]:
for i in df.index:
    print(i)

a
b
c
d

In [307]:
arr= df.values[df.values<0]
for i in df.columns:
    for j in df.index:
        if df[i][j] in arr:
            print(df[i][j], end=" ")

-1.0510815639071178 -0.34745899102186334 -1.0099418765878465 -0.3675481161171661 -0.7776194131918178 -1.1374596907250272 -1.3221475225908594 -1.8380677677579502 -1.0434500017467254 -0.9387686311201282

In [264]:
print(arr)

[-0.77761941 -1.05108156 -0.36754812 -1.13745969 -1.32214752 -0.34745899
 -1.04345    -1.00994188 -1.83806777 -0.93876863]

In [266]:
l = df.values[df<0]
for c in df.columns:
    for v in df.index:
        if df[c][v] in l:
            print(c,v,df[c][v])

s b -1.0510815639071178
s c -0.34745899102186334
s d -1.0099418765878465
t b -0.3675481161171661
u a -0.7776194131918178
u b -1.1374596907250272
v b -1.3221475225908594
v d -1.8380677677579502
w c -1.0434500017467254
w d -0.9387686311201282

In [267]:
print(l)

[-0.77761941 -1.05108156 -0.36754812 -1.13745969 -1.32214752 -0.34745899
 -1.04345    -1.00994188 -1.83806777 -0.93876863]

In [271]:
df

          s         t         u         v         w
a  0.666988  0.025813 -0.777619  0.948634  0.701672
b -1.051082 -0.367548 -1.137460 -1.322148  1.772258
c -0.347459  0.670140  0.322272  0.060343 -1.043450
d -1.009942  0.441736  1.128877 -1.838068 -0.938769

In [280]:
for i in df.columns:
    print(df[i])

a    0.666988
b   -1.051082
c   -0.347459
d   -1.009942
Name: s, dtype: float64
a    0.025813
b   -0.367548
c    0.670140
d    0.441736
Name: t, dtype: float64
a   -0.777619
b   -1.137460
c    0.322272
d    1.128877
Name: u, dtype: float64
a    0.948634
b   -1.322148
c    0.060343
d   -1.838068
Name: v, dtype: float64
a    0.701672
b    1.772258
c   -1.043450
d   -0.938769
Name: w, dtype: float64

In [309]:
for i in df.columns:
    for j in df.index:
        if df[i][j] in arr:
            print (i,j,df.loc[j,i])

s b -1.0510815639071178
s c -0.34745899102186334
s d -1.0099418765878465
t b -0.3675481161171661
u a -0.7776194131918178
u b -1.1374596907250272
v b -1.3221475225908594
v d -1.8380677677579502
w c -1.0434500017467254
w d -0.9387686311201282

In [312]:
for i in df.columns:
    for j in df.index:
        if df.loc[j,i] < 0:
            print (i,j,df.loc[j,i])

s b -1.0510815639071178
s c -0.34745899102186334
s d -1.0099418765878465
t b -0.3675481161171661
u a -0.7776194131918178
u b -1.1374596907250272
v b -1.3221475225908594
v d -1.8380677677579502
w c -1.0434500017467254
w d -0.9387686311201282

In [313]:
for i in df.columns:
    for j in df.index:
        if df.loc[j,i] in arr:
            print (i,j,df.loc[j,i])

s b -1.0510815639071178
s c -0.34745899102186334
s d -1.0099418765878465
t b -0.3675481161171661
u a -0.7776194131918178
u b -1.1374596907250272
v b -1.3221475225908594
v d -1.8380677677579502
w c -1.0434500017467254
w d -0.9387686311201282

In [318]:
d = {'key1':[1,2,3,4,np.nan],"key2":["sudh" ,"kumar" , 4,5,6] ,'key3' :[np.nan,np.nan,np.nan,3,8]}
df = pd.DataFrame(d)

In [319]:
df

   key1   key2  key3
0   1.0   sudh   NaN
1   2.0  kumar   NaN
2   3.0      4   NaN
3   4.0      5   3.0
4   NaN      6   8.0

In [320]:
df.dropna()

   key1 key2  key3
3   4.0    5   3.0

In [321]:
df.dropna(axis=1)

    key2
0   sudh
1  kumar
2      4
3      5
4      6

In [322]:
d = {'key1':[1,2,3,4,np.nan],"key2":["sudh" ,"kumar" , np.nan,5,6] ,'key3' :[np.nan,np.nan,np.nan,3,8]}
df = pd.DataFrame(d)

In [323]:
df.dropna()

   key1 key2  key3
3   4.0    5   3.0

In [324]:
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [325]:
df.dropna(thresh=0)

   key1   key2  key3
0   1.0   sudh   NaN
1   2.0  kumar   NaN
2   3.0    NaN   NaN
3   4.0      5   3.0
4   NaN      6   8.0

In [326]:
df.dropna(thresh=1)

   key1   key2  key3
0   1.0   sudh   NaN
1   2.0  kumar   NaN
2   3.0    NaN   NaN
3   4.0      5   3.0
4   NaN      6   8.0

In [327]:
df.dropna(thresh=2)

   key1   key2  key3
0   1.0   sudh   NaN
1   2.0  kumar   NaN
3   4.0      5   3.0
4   NaN      6   8.0

In [328]:
df.dropna(thresh=3)

   key1 key2  key3
3   4.0    5   3.0

In [329]:
df.dropna(thresh=4)

Empty DataFrame
Columns: [key1, key2, key3]
Index: []

In [330]:
df.dropna(axis=1, thresh=3)

   key1   key2
0   1.0   sudh
1   2.0  kumar
2   3.0    NaN
3   4.0      5
4   NaN      6

In [331]:
df

   key1   key2  key3
0   1.0   sudh   NaN
1   2.0  kumar   NaN
2   3.0    NaN   NaN
3   4.0      5   3.0
4   NaN      6   8.0

In [332]:
df.fillna(56)

   key1   key2  key3
0   1.0   sudh  56.0
1   2.0  kumar  56.0
2   3.0     56  56.0
3   4.0      5   3.0
4  56.0      6   8.0

In [334]:
df.fillna(value=df["key1"].mean())

   key1   key2  key3
0   1.0   sudh   2.5
1   2.0  kumar   2.5
2   3.0    2.5   2.5
3   4.0      5   3.0
4   2.5      6   8.0

In [335]:
df

   key1   key2  key3
0   1.0   sudh   NaN
1   2.0  kumar   NaN
2   3.0    NaN   NaN
3   4.0      5   3.0
4   NaN      6   8.0

In [7]:
d1 = {'name' :['sudh' , 'visal' , 'umang', 'vishal' ,'umang'],"mail_id" :["sudh@gmail.com", "vishal@gmail.com",'umang@gmail.com','vishal@gmail.com','umang@gmail.com'],
     'salary' :[100,200,500,200,500]}

In [8]:
df=pd.DataFrame(d1)

In [9]:
df

     name           mail_id  salary
0    sudh    sudh@gmail.com     100
1   visal  vishal@gmail.com     200
2   umang   umang@gmail.com     500
3  vishal  vishal@gmail.com     200
4   umang   umang@gmail.com     500

In [10]:
df.groupby("name").mean()

        salary
name
sudh     100.0
umang    500.0
visal    200.0
vishal   200.0

In [11]:
df.groupby("mail_id").mean()

                  salary
mail_id
sudh@gmail.com     100.0
umang@gmail.com    500.0
vishal@gmail.com   200.0

In [12]:
df.groupby("mail_id").sum()

                  salary
mail_id
sudh@gmail.com       100
umang@gmail.com     1000
vishal@gmail.com     400

In [13]:
df.groupby("mail_id").describe()

                 salary
                  count   mean  std    min    25%    50%    75%    max
mail_id
sudh@gmail.com      1.0  100.0  NaN  100.0  100.0  100.0  100.0  100.0
umang@gmail.com     2.0  500.0  0.0  500.0  500.0  500.0  500.0  500.0
vishal@gmail.com    2.0  200.0  0.0  200.0  200.0  200.0  200.0  200.0

In [14]:
df.groupby("mail_id").describe().loc["umang@gmail.com"]

salary  count      2.0
        mean     500.0
        std        0.0
        min      500.0
        25%      500.0
        50%      500.0
        75%      500.0
        max      500.0
Name: umang@gmail.com, dtype: float64

In [15]:
df.groupby("mail_id").describe().loc["umang@gmail.com"]["salary"]

count      2.0
mean     500.0
std        0.0
min      500.0
25%      500.0
50%      500.0
75%      500.0
max      500.0
Name: umang@gmail.com, dtype: float64

In [16]:
df.groupby("mail_id").describe().loc["umang@gmail.com"]['salary']['mean']

500.0

In [17]:
df.groupby("mail_id").describe().T

mail_id       sudh@gmail.com  umang@gmail.com  vishal@gmail.com
salary count             1.0              2.0               2.0
       mean            100.0            500.0             200.0
       std               NaN              0.0               0.0
       min             100.0            500.0             200.0
       25%             100.0            500.0             200.0
       50%             100.0            500.0             200.0
       75%             100.0            500.0             200.0
       max             100.0            500.0             200.0

In [18]:
df.groupby("mail_id").describe()

                 salary
                  count   mean  std    min    25%    50%    75%    max
mail_id
sudh@gmail.com      1.0  100.0  NaN  100.0  100.0  100.0  100.0  100.0
umang@gmail.com     2.0  500.0  0.0  500.0  500.0  500.0  500.0  500.0
vishal@gmail.com    2.0  200.0  0.0  200.0  200.0  200.0  200.0  200.0

In [39]:
arr1= np.random.randn(3,4)
arr2= np.random.randn(3,4)
arr3= np.random.randn(3,4)

In [40]:
df1= pd.DataFrame(arr1,columns=["a","b","c","d"], index=["0","1","2"])

In [41]:
df2= pd.DataFrame(arr2,columns=["a","b","c","d"], index=["3","4","5"])

In [42]:
df3= pd.DataFrame(arr3,columns=["a","b","c","d"], index=["6","7","8"])

In [43]:
df1

          a         b         c         d
0  0.535465  0.001656 -1.440898 -0.141480
1  0.981739 -0.759533 -0.811536 -0.804195
2  0.338677  0.859242  0.820836  0.013121

In [44]:
df2

          a         b         c         d
3 -0.665364 -0.006884 -1.469209  0.782304
4 -1.209587 -0.568142 -0.305012  0.326481
5 -0.776553  1.851455  0.991870 -0.542065

In [45]:
df3

          a         b         c         d
6  0.931427 -1.965688  0.722263 -2.329063
7  0.479651  1.006925  0.123730  0.489104
8  1.057580  0.665145  0.161749  0.054486

In [46]:
# row Concatination

In [47]:
pd.concat([df1,df2,df3])

          a         b         c         d
0  0.535465  0.001656 -1.440898 -0.141480
1  0.981739 -0.759533 -0.811536 -0.804195
2  0.338677  0.859242  0.820836  0.013121
3 -0.665364 -0.006884 -1.469209  0.782304
4 -1.209587 -0.568142 -0.305012  0.326481
5 -0.776553  1.851455  0.991870 -0.542065
6  0.931427 -1.965688  0.722263 -2.329063
7  0.479651  1.006925  0.123730  0.489104
8  1.057580  0.665145  0.161749  0.054486

In [48]:
## column Concatination

In [50]:
df4= pd.concat([df1,df2,df3], axis= 1)

In [51]:
df4

,a,b,c,d,a,b,c,d,a,b,c,d
0,0.535465,0.001656,-1.440898,-0.141480,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,0.981739,-0.759533,-0.811536,-0.804195,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,0.338677,0.859242,0.820836,0.013121,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,-0.665364,-0.006884,-1.469209,0.782304,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,-1.209587,-0.568142,-0.305012,0.326481,NaN,NaN,NaN,NaN
5,NaN,NaN,NaN,NaN,-0.776553,1.851455,0.991870,-0.542065,NaN,NaN,NaN,NaN
6,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0.931427,-1.965688,0.722263,-2.329063
7,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0.479651,1.006925,0.123730,0.489104
8,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1.057580,0.665145,0.161749,0.054486

In [52]:
df4.iloc[0]

a    0.535465
b    0.001656
c   -1.440898
d   -0.141480
a         NaN
b         NaN
c         NaN
d         NaN
a         NaN
b         NaN
c         NaN
d         NaN
Name: 0, dtype: float64

In [53]:
df4.loc["0"]

a    0.535465
b    0.001656
c   -1.440898
d   -0.141480
a         NaN
b         NaN
c         NaN
d         NaN
a         NaN
b         NaN
c         NaN
d         NaN
Name: 0, dtype: float64

In [54]:
arr4= np.random.randn(3,4)
arr5= np.random.randn(3,4)
arr6= np.random.randn(3,4)

In [55]:
df4= pd.DataFrame(arr4,columns=["a","b","c","d"], index=["0","1","2"])

In [56]:
df5= pd.DataFrame(arr5,columns=["a","b","c","d"], index=["0","1","2"])

In [57]:
df6= pd.DataFrame(arr6,columns=["a","b","c","d"], index=["0","1","2"])

In [58]:
df4

          a         b         c         d
0 -0.539402 -0.703251  0.331939  0.978220
1 -2.532498  1.416679 -0.598350  1.137569
2 -0.124736  1.479435  0.300058 -1.020875

In [59]:
df5

          a         b         c         d
0  0.262266  2.256778 -0.845233  0.152062
1  0.820469  1.054844  0.691930  0.336323
2  0.528280 -1.279876  1.043684  0.391496

In [60]:
df6

          a         b         c         d
0 -0.434141  0.376063  1.021190  0.760622
1  0.564507 -0.281812  0.373345  0.029189
2  0.905692 -0.092136  1.113696 -1.369965

In [68]:
df7.iloc[0]

a   -0.539402
b   -0.703251
c    0.331939
d    0.978220
a    0.262266
b    2.256778
c   -0.845233
d    0.152062
a   -0.434141
b    0.376063
c    1.021190
d    0.760622
Name: 0, dtype: float64

In [72]:
df7= pd.concat([df4,df5,df6])

In [73]:
df7

          a         b         c         d
0 -0.539402 -0.703251  0.331939  0.978220
1 -2.532498  1.416679 -0.598350  1.137569
2 -0.124736  1.479435  0.300058 -1.020875
0  0.262266  2.256778 -0.845233  0.152062
1  0.820469  1.054844  0.691930  0.336323
2  0.528280 -1.279876  1.043684  0.391496
0 -0.434141  0.376063  1.021190  0.760622
1  0.564507 -0.281812  0.373345  0.029189
2  0.905692 -0.092136  1.113696 -1.369965

In [74]:
df7.iloc[0]

a   -0.539402
b   -0.703251
c    0.331939
d    0.978220
Name: 0, dtype: float64

In [75]:
df7.loc["0"]

          a         b         c         d
0 -0.539402 -0.703251  0.331939  0.978220
0  0.262266  2.256778 -0.845233  0.152062
0 -0.434141  0.376063  1.021190  0.760622

In [76]:
df8= pd.concat([df4,df5,df6], axis=1)

In [77]:
df8

,a,b,c,d,a,b,c,d,a,b,c,d
0,-0.539402,-0.703251,0.331939,0.978220,0.262266,2.256778,-0.845233,0.152062,-0.434141,0.376063,1.021190,0.760622
1,-2.532498,1.416679,-0.598350,1.137569,0.820469,1.054844,0.691930,0.336323,0.564507,-0.281812,0.373345,0.029189
2,-0.124736,1.479435,0.300058,-1.020875,0.528280,-1.279876,1.043684,0.391496,0.905692,-0.092136,1.113696,-1.369965

In [78]:
df8.a

          a         a         a
0 -0.539402  0.262266 -0.434141
1 -2.532498  0.820469  0.564507
2 -0.124736  0.528280  0.905692

In [79]:
df8["a"]

          a         a         a
0 -0.539402  0.262266 -0.434141
1 -2.532498  0.820469  0.564507
2 -0.124736  0.528280  0.905692

In [80]:
df8.iloc[:,4]

0    0.262266
1    0.820469
2    0.528280
Name: a, dtype: float64

In [81]:
arr7= np.random.randn(3,4)
arr8= np.random.randn(3,4)
arr9= np.random.randn(3,4)

In [84]:
df9= pd.DataFrame(arr7,columns=["a","b","c","d"], index=["0","1","2"])

In [85]:
df10= pd.DataFrame(arr8,columns=["a","b","c","d"], index=["3","4","5"])

In [86]:
df11= pd.DataFrame(arr9,columns=["a","b","c","d"], index=["6","7","8"])

In [87]:
df9

          a         b         c         d
0 -0.770559  0.785208 -1.795135  0.188399
1  0.080773  0.205091  1.493009 -1.058817
2 -0.575847 -0.075348  1.336574  1.393397

In [88]:
df10

          a         b         c         d
3  0.008281 -1.294515  1.376948 -0.418691
4  0.097541  0.525537  0.173702  0.974940
5  2.152434  2.186586  0.002416 -0.447648

In [89]:
df11

          a         b         c         d
6  0.715893  1.046826  0.765598  1.056201
7  0.464474  0.179735 -1.948615  1.942540
8  0.475188 -0.234780  1.066078  0.194379

In [99]:
df12= pd.concat([df9, df10, df11], axis =1)

In [100]:
df12

,a,b,c,d,a,b,c,d,a,b,c,d
0,-0.770559,0.785208,-1.795135,0.188399,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,0.080773,0.205091,1.493009,-1.058817,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,-0.575847,-0.075348,1.336574,1.393397,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,0.008281,-1.294515,1.376948,-0.418691,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,0.097541,0.525537,0.173702,0.974940,NaN,NaN,NaN,NaN
5,NaN,NaN,NaN,NaN,2.152434,2.186586,0.002416,-0.447648,NaN,NaN,NaN,NaN
6,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0.715893,1.046826,0.765598,1.056201
7,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0.464474,0.179735,-1.948615,1.942540
8,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0.475188,-0.234780,1.066078,0.194379

In [101]:
df12.fillna(0)

,a,b,c,d,a,b,c,d,a,b,c,d
0,-0.770559,0.785208,-1.795135,0.188399,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
1,0.080773,0.205091,1.493009,-1.058817,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
2,-0.575847,-0.075348,1.336574,1.393397,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
3,0.000000,0.000000,0.000000,0.000000,0.008281,-1.294515,1.376948,-0.418691,0.000000,0.000000,0.000000,0.000000
4,0.000000,0.000000,0.000000,0.000000,0.097541,0.525537,0.173702,0.974940,0.000000,0.000000,0.000000,0.000000
5,0.000000,0.000000,0.000000,0.000000,2.152434,2.186586,0.002416,-0.447648,0.000000,0.000000,0.000000,0.000000
6,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.715893,1.046826,0.765598,1.056201
7,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.464474,0.179735,-1.948615,1.942540
8,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.475188,-0.234780,1.066078,0.194379

In [102]:
df13= pd.concat([df9, df10, df11], axis =1).fillna(0)

In [104]:
df13

,a,b,c,d,a,b,c,d,a,b,c,d
0,-0.770559,0.785208,-1.795135,0.188399,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
1,0.080773,0.205091,1.493009,-1.058817,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
2,-0.575847,-0.075348,1.336574,1.393397,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
3,0.000000,0.000000,0.000000,0.000000,0.008281,-1.294515,1.376948,-0.418691,0.000000,0.000000,0.000000,0.000000
4,0.000000,0.000000,0.000000,0.000000,0.097541,0.525537,0.173702,0.974940,0.000000,0.000000,0.000000,0.000000
5,0.000000,0.000000,0.000000,0.000000,2.152434,2.186586,0.002416,-0.447648,0.000000,0.000000,0.000000,0.000000
6,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.715893,1.046826,0.765598,1.056201
7,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.464474,0.179735,-1.948615,1.942540
8,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.475188,-0.234780,1.066078,0.194379

In [105]:
## merge operation on dataframe

In [107]:
np.random.seed(23)
arr01= np.random.randn(3,4)
np.random.seed(23)
arr02= np.random.randn(3,4)
df12= pd.DataFrame(arr01,columns=["a","b","c","d"], index=["0","1","2"])
df13= pd.DataFrame(arr02,columns=["a","b","c","d"], index=["3","4","5"])

In [108]:
df12

          a         b         c         d
0  0.666988  0.025813 -0.777619  0.948634
1  0.701672 -1.051082 -0.367548 -1.137460
2 -1.322148  1.772258 -0.347459  0.670140

In [109]:
df13

          a         b         c         d
3  0.666988  0.025813 -0.777619  0.948634
4  0.701672 -1.051082 -0.367548 -1.137460
5 -1.322148  1.772258 -0.347459  0.670140

In [110]:
pd.merge(df12, df13, on= "a")

          a       b_x       c_x       d_x       b_y       c_y       d_y
0  0.666988  0.025813 -0.777619  0.948634  0.025813 -0.777619  0.948634
1  0.701672 -1.051082 -0.367548 -1.137460 -1.051082 -0.367548 -1.137460
2 -1.322148  1.772258 -0.347459  0.670140  1.772258 -0.347459  0.670140

In [111]:
df1 = pd.DataFrame({'key': ['K0', 'K8', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
df2 = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [112]:
df1

  key   A   B
0  K0  A0  B0
1  K8  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [113]:
df2

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [114]:
pd.merge(df1, df2, on= "key")

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K2  A2  B2  C2  D2
2  K3  A3  B3  C3  D3

In [116]:
pd.merge(df1, df2, on= "key", how="left")

  key   A   B    C    D
0  K0  A0  B0   C0   D0
1  K8  A1  B1  NaN  NaN
2  K2  A2  B2   C2   D2
3  K3  A3  B3   C3   D3

In [117]:
pd.merge(df1, df2, on= "key", how="right")

  key    A    B   C   D
0  K0   A0   B0  C0  D0
1  K1  NaN  NaN  C1  D1
2  K2   A2   B2  C2  D2
3  K3   A3   B3  C3  D3

In [119]:
pd.merge(df1, df2, on= "key", how="inner")

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K2  A2  B2  C2  D2
2  K3  A3  B3  C3  D3

In [118]:
pd.merge(df1, df2, on= "key", how="outer")

  key    A    B    C    D
0  K0   A0   B0   C0   D0
1  K8   A1   B1  NaN  NaN
2  K2   A2   B2   C2   D2
3  K3   A3   B3   C3   D3
4  K1  NaN  NaN   C1   D1

In [120]:
df1 = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
df2 = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [121]:
df1

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [122]:
df2

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [124]:
pd.merge(df1, df2, on=["key1", "key2"])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [125]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

df2 = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [126]:
df1

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [127]:
df2

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [128]:
df1.join(df2)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [129]:
df1.join(df2,how = 'right')

      A    B   C   D
K0   A0   B0  C0  D0
K2   A2   B2  C2  D2
K3  NaN  NaN  C3  D3

In [130]:
df1.join(df2,how = 'inner')

     A   B   C   D
K0  A0  B0  C0  D0
K2  A2  B2  C2  D2

In [131]:
df1.join(df2,how = 'outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3